Microchip-MPLAB-Harmony/csp_apps_pic32cm_jh00_jh01/apps/rtc/rtc_alarm/firmware/src/packs/PIC32CM5164JH00100_DFP/component/eic.h
#define EIC_DEBOUNCEN_DEBOUNCEN0_Pos          _U_(0)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT0 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN0_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN0_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT0 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN0(value)       (EIC_DEBOUNCEN_DEBOUNCEN0_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN0_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN1_Pos          _U_(1)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT1 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN1_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN1_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT1 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN1(value)       (EIC_DEBOUNCEN_DEBOUNCEN1_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN1_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN2_Pos          _U_(2)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT2 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN2_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN2_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT2 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN2(value)       (EIC_DEBOUNCEN_DEBOUNCEN2_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN2_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN3_Pos          _U_(3)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT3 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN3_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN3_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT3 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN3(value)       (EIC_DEBOUNCEN_DEBOUNCEN3_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN3_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN4_Pos          _U_(4)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT4 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN4_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN4_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT4 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN4(value)       (EIC_DEBOUNCEN_DEBOUNCEN4_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN4_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN5_Pos          _U_(5)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT5 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN5_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN5_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT5 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN5(value)       (EIC_DEBOUNCEN_DEBOUNCEN5_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN5_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN6_Pos          _U_(6)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT6 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN6_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN6_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT6 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN6(value)       (EIC_DEBOUNCEN_DEBOUNCEN6_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN6_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN7_Pos          _U_(7)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT7 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN7_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN7_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT7 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN7(value)       (EIC_DEBOUNCEN_DEBOUNCEN7_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN7_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN8_Pos          _U_(8)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT8 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN8_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN8_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT8 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN8(value)       (EIC_DEBOUNCEN_DEBOUNCEN8_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN8_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN9_Pos          _U_(9)                                               /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT9 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN9_Msk          (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN9_Pos)           /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT9 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN9(value)       (EIC_DEBOUNCEN_DEBOUNCEN9_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN9_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN10_Pos         _U_(10)                                              /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT10 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN10_Msk         (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN10_Pos)          /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT10 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN10(value)      (EIC_DEBOUNCEN_DEBOUNCEN10_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN10_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN11_Pos         _U_(11)                                              /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT11 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN11_Msk         (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN11_Pos)          /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT11 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN11(value)      (EIC_DEBOUNCEN_DEBOUNCEN11_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN11_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN12_Pos         _U_(12)                                              /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT12 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN12_Msk         (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN12_Pos)          /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT12 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN12(value)      (EIC_DEBOUNCEN_DEBOUNCEN12_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN12_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN13_Pos         _U_(13)                                              /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT13 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN13_Msk         (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN13_Pos)          /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT13 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN13(value)      (EIC_DEBOUNCEN_DEBOUNCEN13_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN13_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN14_Pos         _U_(14)                                              /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT14 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN14_Msk         (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN14_Pos)          /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT14 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN14(value)      (EIC_DEBOUNCEN_DEBOUNCEN14_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN14_Pos))
#define EIC_DEBOUNCEN_DEBOUNCEN15_Pos         _U_(15)                                              /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT15 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN15_Msk         (_U_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN15_Pos)          /**< (EIC_DEBOUNCEN) Debouncer Enable of EXTINT15 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN15(value)      (EIC_DEBOUNCEN_DEBOUNCEN15_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN15_Pos))
#define EIC_DEBOUNCEN_Msk                     _U_(0x0000FFFF)                                      /**< (EIC_DEBOUNCEN) Register Mask  */

