Microchip-MPLAB-Harmony/csp_apps_pic32cm_jh00_jh01/apps/rtc/rtc_alarm/firmware/src/packs/PIC32CM5164JH00100_DFP/component/eic.h
#define EIC_DEBOUNCEN_DEBOUNCEN_Pos           _U_(0)                                               /**< (EIC_DEBOUNCEN Position) Debouncer Enable of EXTINTx5 */
#define EIC_DEBOUNCEN_DEBOUNCEN_Msk           (_U_(0xFFFF) << EIC_DEBOUNCEN_DEBOUNCEN_Pos)         /**< (EIC_DEBOUNCEN Mask) DEBOUNCEN */
#define EIC_DEBOUNCEN_DEBOUNCEN(value)        (EIC_DEBOUNCEN_DEBOUNCEN_Msk & ((value) << EIC_DEBOUNCEN_DEBOUNCEN_Pos)) 

/* -------- EIC_DPRESCALER : (EIC Offset: 0x34) (R/W 32) Debouncer Prescaler -------- */
#define EIC_DPRESCALER_RESETVALUE             _U_(0x00)                                            /**<  (EIC_DPRESCALER) Debouncer Prescaler  Reset Value */

#define EIC_DPRESCALER_PRESCALER0_Pos         _U_(0)                                               /**< (EIC_DPRESCALER) Debouncer Prescaler Position */
#define EIC_DPRESCALER_PRESCALER0_Msk         (_U_(0x7) << EIC_DPRESCALER_PRESCALER0_Pos)          /**< (EIC_DPRESCALER) Debouncer Prescaler Mask */
#define EIC_DPRESCALER_PRESCALER0(value)      (EIC_DPRESCALER_PRESCALER0_Msk & ((value) << EIC_DPRESCALER_PRESCALER0_Pos))
#define   EIC_DPRESCALER_PRESCALER0_DIV2_Val  _U_(0x0)                                             /**< (EIC_DPRESCALER) EIC clock divided by 2  */
#define   EIC_DPRESCALER_PRESCALER0_DIV4_Val  _U_(0x1)                                             /**< (EIC_DPRESCALER) EIC clock divided by 4  */
#define   EIC_DPRESCALER_PRESCALER0_DIV8_Val  _U_(0x2)                                             /**< (EIC_DPRESCALER) EIC clock divided by 8  */
#define   EIC_DPRESCALER_PRESCALER0_DIV16_Val _U_(0x3)                                             /**< (EIC_DPRESCALER) EIC clock divided by 16  */
#define   EIC_DPRESCALER_PRESCALER0_DIV32_Val _U_(0x4)                                             /**< (EIC_DPRESCALER) EIC clock divided by 32  */
#define   EIC_DPRESCALER_PRESCALER0_DIV64_Val _U_(0x5)                                             /**< (EIC_DPRESCALER) EIC clock divided by 64  */
#define   EIC_DPRESCALER_PRESCALER0_DIV128_Val _U_(0x6)                                             /**< (EIC_DPRESCALER) EIC clock divided by 128  */
#define   EIC_DPRESCALER_PRESCALER0_DIV256_Val _U_(0x7)                                             /**< (EIC_DPRESCALER) EIC clock divided by 256  */
#define EIC_DPRESCALER_PRESCALER0_DIV2        (EIC_DPRESCALER_PRESCALER0_DIV2_Val << EIC_DPRESCALER_PRESCALER0_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 2 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV4        (EIC_DPRESCALER_PRESCALER0_DIV4_Val << EIC_DPRESCALER_PRESCALER0_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 4 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV8        (EIC_DPRESCALER_PRESCALER0_DIV8_Val << EIC_DPRESCALER_PRESCALER0_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 8 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV16       (EIC_DPRESCALER_PRESCALER0_DIV16_Val << EIC_DPRESCALER_PRESCALER0_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 16 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV32       (EIC_DPRESCALER_PRESCALER0_DIV32_Val << EIC_DPRESCALER_PRESCALER0_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 32 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV64       (EIC_DPRESCALER_PRESCALER0_DIV64_Val << EIC_DPRESCALER_PRESCALER0_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 64 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV128      (EIC_DPRESCALER_PRESCALER0_DIV128_Val << EIC_DPRESCALER_PRESCALER0_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 128 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV256      (EIC_DPRESCALER_PRESCALER0_DIV256_Val << EIC_DPRESCALER_PRESCALER0_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 256 Position  */
#define EIC_DPRESCALER_STATES0_Pos            _U_(3)                                               /**< (EIC_DPRESCALER) Debouncer number of states Position */
#define EIC_DPRESCALER_STATES0_Msk            (_U_(0x1) << EIC_DPRESCALER_STATES0_Pos)             /**< (EIC_DPRESCALER) Debouncer number of states Mask */
#define EIC_DPRESCALER_STATES0(value)         (EIC_DPRESCALER_STATES0_Msk & ((value) << EIC_DPRESCALER_STATES0_Pos))
#define   EIC_DPRESCALER_STATES0_LFREQ3_Val   _U_(0x0)                                             /**< (EIC_DPRESCALER) 3 low frequency samples  */
#define   EIC_DPRESCALER_STATES0_LFREQ7_Val   _U_(0x1)                                             /**< (EIC_DPRESCALER) 7 low frequency samples  */
#define EIC_DPRESCALER_STATES0_LFREQ3         (EIC_DPRESCALER_STATES0_LFREQ3_Val << EIC_DPRESCALER_STATES0_Pos) /**< (EIC_DPRESCALER) 3 low frequency samples Position  */
#define EIC_DPRESCALER_STATES0_LFREQ7         (EIC_DPRESCALER_STATES0_LFREQ7_Val << EIC_DPRESCALER_STATES0_Pos) /**< (EIC_DPRESCALER) 7 low frequency samples Position  */
#define EIC_DPRESCALER_PRESCALER1_Pos         _U_(4)                                               /**< (EIC_DPRESCALER) Debouncer Prescaler Position */
#define EIC_DPRESCALER_PRESCALER1_Msk         (_U_(0x7) << EIC_DPRESCALER_PRESCALER1_Pos)          /**< (EIC_DPRESCALER) Debouncer Prescaler Mask */
#define EIC_DPRESCALER_PRESCALER1(value)      (EIC_DPRESCALER_PRESCALER1_Msk & ((value) << EIC_DPRESCALER_PRESCALER1_Pos))
#define   EIC_DPRESCALER_PRESCALER1_DIV2_Val  _U_(0x0)                                             /**< (EIC_DPRESCALER) EIC clock divided by 2  */
#define   EIC_DPRESCALER_PRESCALER1_DIV4_Val  _U_(0x1)                                             /**< (EIC_DPRESCALER) EIC clock divided by 4  */
#define   EIC_DPRESCALER_PRESCALER1_DIV8_Val  _U_(0x2)                                             /**< (EIC_DPRESCALER) EIC clock divided by 8  */
#define   EIC_DPRESCALER_PRESCALER1_DIV16_Val _U_(0x3)                                             /**< (EIC_DPRESCALER) EIC clock divided by 16  */
#define   EIC_DPRESCALER_PRESCALER1_DIV32_Val _U_(0x4)                                             /**< (EIC_DPRESCALER) EIC clock divided by 32  */
#define   EIC_DPRESCALER_PRESCALER1_DIV64_Val _U_(0x5)                                             /**< (EIC_DPRESCALER) EIC clock divided by 64  */
#define   EIC_DPRESCALER_PRESCALER1_DIV128_Val _U_(0x6)                                             /**< (EIC_DPRESCALER) EIC clock divided by 128  */
#define   EIC_DPRESCALER_PRESCALER1_DIV256_Val _U_(0x7)                                             /**< (EIC_DPRESCALER) EIC clock divided by 256  */
#define EIC_DPRESCALER_PRESCALER1_DIV2        (EIC_DPRESCALER_PRESCALER1_DIV2_Val << EIC_DPRESCALER_PRESCALER1_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 2 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV4        (EIC_DPRESCALER_PRESCALER1_DIV4_Val << EIC_DPRESCALER_PRESCALER1_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 4 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV8        (EIC_DPRESCALER_PRESCALER1_DIV8_Val << EIC_DPRESCALER_PRESCALER1_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 8 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV16       (EIC_DPRESCALER_PRESCALER1_DIV16_Val << EIC_DPRESCALER_PRESCALER1_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 16 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV32       (EIC_DPRESCALER_PRESCALER1_DIV32_Val << EIC_DPRESCALER_PRESCALER1_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 32 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV64       (EIC_DPRESCALER_PRESCALER1_DIV64_Val << EIC_DPRESCALER_PRESCALER1_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 64 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV128      (EIC_DPRESCALER_PRESCALER1_DIV128_Val << EIC_DPRESCALER_PRESCALER1_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 128 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV256      (EIC_DPRESCALER_PRESCALER1_DIV256_Val << EIC_DPRESCALER_PRESCALER1_Pos) /**< (EIC_DPRESCALER) EIC clock divided by 256 Position  */
#define EIC_DPRESCALER_STATES1_Pos            _U_(7)                                               /**< (EIC_DPRESCALER) Debouncer number of states Position */
#define EIC_DPRESCALER_STATES1_Msk            (_U_(0x1) << EIC_DPRESCALER_STATES1_Pos)             /**< (EIC_DPRESCALER) Debouncer number of states Mask */
#define EIC_DPRESCALER_STATES1(value)         (EIC_DPRESCALER_STATES1_Msk & ((value) << EIC_DPRESCALER_STATES1_Pos))
#define   EIC_DPRESCALER_STATES1_LFREQ3_Val   _U_(0x0)                                             /**< (EIC_DPRESCALER) 3 low frequency samples  */
#define   EIC_DPRESCALER_STATES1_LFREQ7_Val   _U_(0x1)                                             /**< (EIC_DPRESCALER) 7 low frequency samples  */
#define EIC_DPRESCALER_STATES1_LFREQ3         (EIC_DPRESCALER_STATES1_LFREQ3_Val << EIC_DPRESCALER_STATES1_Pos) /**< (EIC_DPRESCALER) 3 low frequency samples Position  */
#define EIC_DPRESCALER_STATES1_LFREQ7         (EIC_DPRESCALER_STATES1_LFREQ7_Val << EIC_DPRESCALER_STATES1_Pos) /**< (EIC_DPRESCALER) 7 low frequency samples Position  */
#define EIC_DPRESCALER_TICKON_Pos             _U_(16)                                              /**< (EIC_DPRESCALER) Pin Sampler frequency selection Position */
#define EIC_DPRESCALER_TICKON_Msk             (_U_(0x1) << EIC_DPRESCALER_TICKON_Pos)              /**< (EIC_DPRESCALER) Pin Sampler frequency selection Mask */
#define EIC_DPRESCALER_TICKON(value)          (EIC_DPRESCALER_TICKON_Msk & ((value) << EIC_DPRESCALER_TICKON_Pos))
#define   EIC_DPRESCALER_TICKON_CLK_GCLK_EIC_Val _U_(0x0)                                             /**< (EIC_DPRESCALER) Clocked by GCLK  */
#define   EIC_DPRESCALER_TICKON_CLK_LFREQ_Val _U_(0x1)                                             /**< (EIC_DPRESCALER) Clocked by Low Frequency Clock  */
#define EIC_DPRESCALER_TICKON_CLK_GCLK_EIC    (EIC_DPRESCALER_TICKON_CLK_GCLK_EIC_Val << EIC_DPRESCALER_TICKON_Pos) /**< (EIC_DPRESCALER) Clocked by GCLK Position  */
#define EIC_DPRESCALER_TICKON_CLK_LFREQ       (EIC_DPRESCALER_TICKON_CLK_LFREQ_Val << EIC_DPRESCALER_TICKON_Pos) /**< (EIC_DPRESCALER) Clocked by Low Frequency Clock Position  */
#define EIC_DPRESCALER_Msk                    _U_(0x000100FF)                                      /**< (EIC_DPRESCALER) Register Mask  */


/* -------- EIC_PINSTATE : (EIC Offset: 0x38) ( R/ 32) Pin State -------- */
#define EIC_PINSTATE_RESETVALUE               _U_(0x00)                                            /**<  (EIC_PINSTATE) Pin State  Reset Value */

#define EIC_PINSTATE_PINSTATE0_Pos            _U_(0)                                               /**< (EIC_PINSTATE) Pin State of EXTINT0 Position */
#define EIC_PINSTATE_PINSTATE0_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE0_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT0 Mask */
#define EIC_PINSTATE_PINSTATE0(value)         (EIC_PINSTATE_PINSTATE0_Msk & ((value) << EIC_PINSTATE_PINSTATE0_Pos))
#define EIC_PINSTATE_PINSTATE1_Pos            _U_(1)                                               /**< (EIC_PINSTATE) Pin State of EXTINT1 Position */
#define EIC_PINSTATE_PINSTATE1_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE1_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT1 Mask */
#define EIC_PINSTATE_PINSTATE1(value)         (EIC_PINSTATE_PINSTATE1_Msk & ((value) << EIC_PINSTATE_PINSTATE1_Pos))
#define EIC_PINSTATE_PINSTATE2_Pos            _U_(2)                                               /**< (EIC_PINSTATE) Pin State of EXTINT2 Position */
#define EIC_PINSTATE_PINSTATE2_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE2_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT2 Mask */
#define EIC_PINSTATE_PINSTATE2(value)         (EIC_PINSTATE_PINSTATE2_Msk & ((value) << EIC_PINSTATE_PINSTATE2_Pos))
#define EIC_PINSTATE_PINSTATE3_Pos            _U_(3)                                               /**< (EIC_PINSTATE) Pin State of EXTINT3 Position */
#define EIC_PINSTATE_PINSTATE3_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE3_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT3 Mask */
#define EIC_PINSTATE_PINSTATE3(value)         (EIC_PINSTATE_PINSTATE3_Msk & ((value) << EIC_PINSTATE_PINSTATE3_Pos))
#define EIC_PINSTATE_PINSTATE4_Pos            _U_(4)                                               /**< (EIC_PINSTATE) Pin State of EXTINT4 Position */
#define EIC_PINSTATE_PINSTATE4_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE4_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT4 Mask */
#define EIC_PINSTATE_PINSTATE4(value)         (EIC_PINSTATE_PINSTATE4_Msk & ((value) << EIC_PINSTATE_PINSTATE4_Pos))
#define EIC_PINSTATE_PINSTATE5_Pos            _U_(5)                                               /**< (EIC_PINSTATE) Pin State of EXTINT5 Position */
#define EIC_PINSTATE_PINSTATE5_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE5_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT5 Mask */
#define EIC_PINSTATE_PINSTATE5(value)         (EIC_PINSTATE_PINSTATE5_Msk & ((value) << EIC_PINSTATE_PINSTATE5_Pos))
#define EIC_PINSTATE_PINSTATE6_Pos            _U_(6)                                               /**< (EIC_PINSTATE) Pin State of EXTINT6 Position */
#define EIC_PINSTATE_PINSTATE6_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE6_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT6 Mask */
#define EIC_PINSTATE_PINSTATE6(value)         (EIC_PINSTATE_PINSTATE6_Msk & ((value) << EIC_PINSTATE_PINSTATE6_Pos))
#define EIC_PINSTATE_PINSTATE7_Pos            _U_(7)                                               /**< (EIC_PINSTATE) Pin State of EXTINT7 Position */
#define EIC_PINSTATE_PINSTATE7_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE7_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT7 Mask */
#define EIC_PINSTATE_PINSTATE7(value)         (EIC_PINSTATE_PINSTATE7_Msk & ((value) << EIC_PINSTATE_PINSTATE7_Pos))
#define EIC_PINSTATE_PINSTATE8_Pos            _U_(8)                                               /**< (EIC_PINSTATE) Pin State of EXTINT8 Position */
#define EIC_PINSTATE_PINSTATE8_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE8_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT8 Mask */
#define EIC_PINSTATE_PINSTATE8(value)         (EIC_PINSTATE_PINSTATE8_Msk & ((value) << EIC_PINSTATE_PINSTATE8_Pos))
#define EIC_PINSTATE_PINSTATE9_Pos            _U_(9)                                               /**< (EIC_PINSTATE) Pin State of EXTINT9 Position */
#define EIC_PINSTATE_PINSTATE9_Msk            (_U_(0x1) << EIC_PINSTATE_PINSTATE9_Pos)             /**< (EIC_PINSTATE) Pin State of EXTINT9 Mask */
#define EIC_PINSTATE_PINSTATE9(value)         (EIC_PINSTATE_PINSTATE9_Msk & ((value) << EIC_PINSTATE_PINSTATE9_Pos))
#define EIC_PINSTATE_PINSTATE10_Pos           _U_(10)                                              /**< (EIC_PINSTATE) Pin State of EXTINT10 Position */
#define EIC_PINSTATE_PINSTATE10_Msk           (_U_(0x1) << EIC_PINSTATE_PINSTATE10_Pos)            /**< (EIC_PINSTATE) Pin State of EXTINT10 Mask */
#define EIC_PINSTATE_PINSTATE10(value)        (EIC_PINSTATE_PINSTATE10_Msk & ((value) << EIC_PINSTATE_PINSTATE10_Pos))
#define EIC_PINSTATE_PINSTATE11_Pos           _U_(11)                                              /**< (EIC_PINSTATE) Pin State of EXTINT11 Position */
#define EIC_PINSTATE_PINSTATE11_Msk           (_U_(0x1) << EIC_PINSTATE_PINSTATE11_Pos)            /**< (EIC_PINSTATE) Pin State of EXTINT11 Mask */
#define EIC_PINSTATE_PINSTATE11(value)        (EIC_PINSTATE_PINSTATE11_Msk & ((value) << EIC_PINSTATE_PINSTATE11_Pos))
#define EIC_PINSTATE_PINSTATE12_Pos           _U_(12)                                              /**< (EIC_PINSTATE) Pin State of EXTINT12 Position */
#define EIC_PINSTATE_PINSTATE12_Msk           (_U_(0x1) << EIC_PINSTATE_PINSTATE12_Pos)            /**< (EIC_PINSTATE) Pin State of EXTINT12 Mask */
#define EIC_PINSTATE_PINSTATE12(value)        (EIC_PINSTATE_PINSTATE12_Msk & ((value) << EIC_PINSTATE_PINSTATE12_Pos))
#define EIC_PINSTATE_PINSTATE13_Pos           _U_(13)                                              /**< (EIC_PINSTATE) Pin State of EXTINT13 Position */
#define EIC_PINSTATE_PINSTATE13_Msk           (_U_(0x1) << EIC_PINSTATE_PINSTATE13_Pos)            /**< (EIC_PINSTATE) Pin State of EXTINT13 Mask */
#define EIC_PINSTATE_PINSTATE13(value)        (EIC_PINSTATE_PINSTATE13_Msk & ((value) << EIC_PINSTATE_PINSTATE13_Pos))
#define EIC_PINSTATE_PINSTATE14_Pos           _U_(14)                                              /**< (EIC_PINSTATE) Pin State of EXTINT14 Position */
#define EIC_PINSTATE_PINSTATE14_Msk           (_U_(0x1) << EIC_PINSTATE_PINSTATE14_Pos)            /**< (EIC_PINSTATE) Pin State of EXTINT14 Mask */
#define EIC_PINSTATE_PINSTATE14(value)        (EIC_PINSTATE_PINSTATE14_Msk & ((value) << EIC_PINSTATE_PINSTATE14_Pos))
#define EIC_PINSTATE_PINSTATE15_Pos           _U_(15)                                              /**< (EIC_PINSTATE) Pin State of EXTINT15 Position */
#define EIC_PINSTATE_PINSTATE15_Msk           (_U_(0x1) << EIC_PINSTATE_PINSTATE15_Pos)            /**< (EIC_PINSTATE) Pin State of EXTINT15 Mask */
#define EIC_PINSTATE_PINSTATE15(value)        (EIC_PINSTATE_PINSTATE15_Msk & ((value) << EIC_PINSTATE_PINSTATE15_Pos))
#define EIC_PINSTATE_Msk                      _U_(0x0000FFFF)                                      /**< (EIC_PINSTATE) Register Mask  */

#define EIC_PINSTATE_PINSTATE_Pos             _U_(0)                                               /**< (EIC_PINSTATE Position) Pin State of EXTINTx5 */
#define EIC_PINSTATE_PINSTATE_Msk             (_U_(0xFFFF) << EIC_PINSTATE_PINSTATE_Pos)           /**< (EIC_PINSTATE Mask) PINSTATE */
#define EIC_PINSTATE_PINSTATE(value)          (EIC_PINSTATE_PINSTATE_Msk & ((value) << EIC_PINSTATE_PINSTATE_Pos)) 

/** \brief EIC register offsets definitions */
#define EIC_CTRLA_REG_OFST             (0x00)              /**< (EIC_CTRLA) Control A Offset */
#define EIC_NMICTRL_REG_OFST           (0x01)              /**< (EIC_NMICTRL) Non-Maskable Interrupt Control Offset */
#define EIC_NMIFLAG_REG_OFST           (0x02)              /**< (EIC_NMIFLAG) Non-Maskable Interrupt Flag Status and Clear Offset */
#define EIC_SYNCBUSY_REG_OFST          (0x04)              /**< (EIC_SYNCBUSY) Synchronization Busy Offset */
#define EIC_EVCTRL_REG_OFST            (0x08)              /**< (EIC_EVCTRL) Event Control Offset */
#define EIC_INTENCLR_REG_OFST          (0x0C)              /**< (EIC_INTENCLR) Interrupt Enable Clear Offset */
#define EIC_INTENSET_REG_OFST          (0x10)              /**< (EIC_INTENSET) Interrupt Enable Set Offset */
#define EIC_INTFLAG_REG_OFST           (0x14)              /**< (EIC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define EIC_ASYNCH_REG_OFST            (0x18)              /**< (EIC_ASYNCH) External Interrupt Asynchronous Mode Offset */
#define EIC_CONFIG0_REG_OFST           (0x1C)              /**< (EIC_CONFIG0) External Interrupt Sense Configuration Offset */
#define EIC_CONFIG1_REG_OFST           (0x20)              /**< (EIC_CONFIG1) External Interrupt Sense Configuration Offset */
#define EIC_DEBOUNCEN_REG_OFST         (0x30)              /**< (EIC_DEBOUNCEN) Debouncer Enable Offset */
#define EIC_DPRESCALER_REG_OFST        (0x34)              /**< (EIC_DPRESCALER) Debouncer Prescaler Offset */
#define EIC_PINSTATE_REG_OFST          (0x38)              /**< (EIC_PINSTATE) Pin State Offset */

